freddit/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author = current_user
    if @comment.save!
---
INSERT INTO "comments" ("body", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "This!"], ["author_id", 2], ["post_id", 1], ["parent_comment_id", nil], ["created_at", "2022-09-02 18:26:02.723987"], ["updated_at", "2022-09-02 18:26:02.723987"]]

  def show
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.body = "[DELETED]"
    @comment.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "[DELETED]"], ["updated_at", "2022-09-02 20:39:34.410335"], ["id", 20]]