freddit/app/controllers/comments_controller.rb

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 15]]
---
  def destroy
    if current_user == @comment.moderator
      @comment = Comment.find(params[:id])
      @comment.destroy if @comment