freddit/app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @sub = Sub.find(params[:sub_id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.sub = Sub.find(params[:sub_id])
    @post.author = current_user
    if @post.save!
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Hello world"], ["url", nil], ["content", nil], ["sub_id", 1], ["author_id", 1], ["created_at", "2022-09-02 16:09:40.601017"], ["updated_at", "2022-09-02 16:09:40.601017"]]

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    if current_user == @post.moderator
      @post = Post.find(params[:id])
      @post.destroy if @post
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]