freddit/app/controllers/subs_controller.rb

  def index
    @subs = Sub.all.includes(:posts)
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" IN ($1, $2)  [["sub_id", 1], ["sub_id", 2]]
SELECT "subs".* FROM "subs"

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator = current_user
    if @sub.save!
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    subs = Sub.where(id: params[:id]).includes(:posts)
    @sub = subs.first
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 ORDER BY "subs"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    if current_user == @sub.moderator
      @sub = Sub.find(params[:id])
      @sub.destroy if @sub
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 2]]