freddit/app/models/post.rb

  def comments_by_parent_id
    hash = Hash.new { |h, k| h[k] = [] }

    comments = Comment.where(post_id: self.id).joins(:author)
    comments.each do |comment|
---
SELECT "comments".* FROM "comments" INNER JOIN "users" ON "users"."id" = "comments"."author_id" WHERE "comments"."post_id" = $1  [["post_id", 5]]