freddit/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ford"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    token = SecureRandom.urlsafe_base64
    while User.find_by(session_token: token)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-09-02 15:46:53.865205"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.generate_unique_session_token
    self.save